samples/soap-request-gls-ok-2.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:ns1="http://dhl.de/webservice/cisbase" xmlns:ns2="http://de.ws.intraship" xmlns:ns3="ns1">
    <SOAP-ENV:Header>
        <ns1:Authentification>
            <ns1:user>biznessrocket</ns1:user>
            <ns1:signature>Dns9!YEl1225=4590!$4</ns1:signature>
            <ns1:type>0</ns1:type>
        </ns1:Authentification>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <ns2:CreateShipmentDDRequest>
            <ns1:Version>
                <ns1:majorRelease>1</ns1:majorRelease>
                <ns1:minorRelease>0</ns1:minorRelease>
            </ns1:Version>
            <ShipmentOrder>
                <SequenceNumber>1</SequenceNumber>
                <Shipment>
                    <ShipmentDetails>
                        <ProductCode>GLS</ProductCode>
                        <ShipmentDate>2024-03-14</ShipmentDate>
                        <DeclaredValueOfGoods>299.95</DeclaredValueOfGoods>
                        <DeclaredValueOfGoodsCurrency>EUR</DeclaredValueOfGoodsCurrency>
                        <ns1:EKP>6270883525</ns1:EKP>
                        <Attendance>
                            <ns1:partnerID>01</ns1:partnerID>
                        </Attendance>
                        <CustomerReference>100106127</CustomerReference>
                        <ShipmentItem>
                            <WeightInKG>10.5</WeightInKG>
                            <PackageType>PK</PackageType>
                        </ShipmentItem>
                    </ShipmentDetails>
                    <Shipper>
                        <Company>
                            <ns1:Company>
                                <ns1:name1>handgefertigtes.de</ns1:name1>
                                <ns1:name2>c/o Antikas</ns1:name2>
                            </ns1:Company>
                        </Company>
                        <Address>
                            <ns1:streetName>Kopenhagener Str.</ns1:streetName>
                            <ns1:streetNumber>2</ns1:streetNumber>
                            <ns1:Zip>
                                <ns1:germany>48455</ns1:germany>
                            </ns1:Zip>
                            <ns1:city>Bad Bentheim</ns1:city>
                            <ns1:Origin>
                                <ns1:country>Deutschland</ns1:country>
                                <ns1:countryISOCode>DE</ns1:countryISOCode>
                                <ns1:state></ns1:state>
                            </ns1:Origin>
                        </Address>
                        <Communication>
                            <ns1:phone>025519867050</ns1:phone>
                            <ns1:email>info@handgefertigtes.de</ns1:email>
                            <ns1:contactPerson>Support</ns1:contactPerson>
                        </Communication>
                    </Shipper>
                    <Receiver>
                        <Company>
                            <ns1:Person>
                                <ns1:salutation></ns1:salutation>
                                <ns1:title></ns1:title>
                                <ns1:firstname>Hubert</ns1:firstname>
                                <ns1:middlename></ns1:middlename>
                                <ns1:lastname>Priefer</ns1:lastname>
                            </ns1:Person>
                        </Company>
                        <Address>
                            <ns1:streetName>Auf dem Kiewitt</ns1:streetName>
                            <ns1:streetNumber>12</ns1:streetNumber>
                            <ns1:careOfName></ns1:careOfName>
                            <ns1:Zip>
                                <ns1:germany>14471</ns1:germany>
                            </ns1:Zip>
                            <ns1:city>Potsdam</ns1:city>
                            <ns1:Origin>
                                <ns1:country>Deutschland</ns1:country>
                                <ns1:countryISOCode>DE</ns1:countryISOCode>
                                <ns1:state></ns1:state>
                            </ns1:Origin>
                        </Address>
                        <Communication>
                            <ns1:phone>017657971624</ns1:phone>
                            <ns1:contactPerson></ns1:contactPerson>
                        </Communication>
                    </Receiver>
                </Shipment>
                <LabelResponseType>URL</LabelResponseType>
            </ShipmentOrder>
        </ns2:CreateShipmentDDRequest>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>